DSJZS/yuangod_smart_car/lidar_esp32/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.5 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LD14_UART_RXD=18
CONFIG_LD14_UART_TXD=19
CONFIG_ROS2_SERVER_HOST_IP_ADDR="10.3.84.19"
CONFIG_ROS2_SERVER_PORT=8888
CONFIG_ESP_WIFI_SSID="yuangod_smart_car"
CONFIG_ESP_WIFI_PASSWORD="car_car_need_pass"
